//--------------------------------------------------------------------------------------
// texps.fx
//--------------------------------------------------------------------------------------
struct PS_IN {
	float4 pos : SV_POSITION;
	float2 tex : TEXCOORD0;
};

Texture2D myTexture:register(t0);//テクスチャー
SamplerState mySampler:register(s0);//サンプラー
//--------------------------------------------------------------------------------------
//  ピクセルシェーダー
//--------------------------------------------------------------------------------------
float4 main(PS_IN input) : SV_Target
{
	return myTexture.Sample(mySampler,input.tex);
}